n = int(input())
n1 = n
a = n
s = 0
while n1 > 0:
    s = s + 1
    n1 = n1 // 10
if s == 1:
    print('число абрикосовое')
if s == 2:
    a1 = a // 10
    a2 = a % 10
    if a1 <= a2:
        print('число абрикосовое')
    else:
        print('число не абрикосовое')
if s == 3:
    a1 = a // 100
    a2 = a % 100 // 10
    a3 = a % 10
    if a1 <= a2 <= a3:
        print('число абрикосовое')
    else:
        print('число не абрикосовое')
if s == 4:
    a1 = a // 1000
    a2 = a % 1000 // 100
    a3 = a % 100 // 10
    a4 = a % 10
    if a1 <= a2 <= a3 <= a4:
        print('число абрикосовое')
    else:
        print('число не абрикосовое')
if s == 5:
    a1 = a // 10000
    a2 = a % 10000 // 1000
    a3 = a % 1000 // 100
    a4 = a % 100 // 10
    a5 = a % 10
    if a1 <= a2 <= a3 <= a4 <= a5:
        print('число абрикосовое')
    else:
        print('число не абрикосовое')
if s == 6:
    a1 = a // 100000
    a2 = a % 100000 // 10000
    a3 = a % 10000 // 1000
    a4 = a % 1000 // 100
    a5 = a % 100 // 10
    a6 = a % 10
    if a1 <= a2 <= a3 <= a4 <= a5 <= a6:
        print('число абрикосовое')
    else:
        print('число не абрикосовое')
